LETS_SEARCH = 'Пришли текст, который был на картинке, я попробую что-нибудь найти'

TOO_MANY_RESULTS = 'Результатов так много, что ты идёшь нахуй по причине конченый долбаёб'

NEED_TO_REPLY = 'Ебаный рот этого казино, блять. Ты кто такой, сука? Чтоб это сделать? Вы че, дибилы? Вы че, ' \
                'ебанутые? Вы внатуре ебанутые. Этот сидит там команды /bet кидает и не реплаит сообщение, на которое' \
                ' нужно делать ставку. Блять, дифиченты какие-то, ебаный ваш рот, а. Ты че делаешь?!'

SELECT_TARGET_USER = 'Кто должен оподливиться?'

NO_MESSAGE_IN_DATABASE = 'Бот зарядил колоду и это сообщение с мемом не сохранено в базе данных. Никаких ставок на него'

ZERO_BALANCE = 'Какие ставки? У тебя на счёте 0'

SEND_AMOUNT = 'Сколько ставим? У тебя доступно Ржомбокоинов: {}\n\nУ @{}: {}'

CALL_TARGET_USER = 'Автор ставки: @{}\n' \
                   '@{}, ты поржал или нет?\n\nСтавка: {} Ржомбкоинов'

SEND_FLOAT_AMOUNT = 'Ты мне мозги не еби, я спрашиваю СКОЛЬКО? Говорю прислать сумму, он мне мозг буквами дрочит'

POOR_USERS = 'У всех на счетах по нулям, не с кем забиваться'

BET_NOT_VALID = 'Нельзя делать ставку на самого себя'

TOO_MUCH = 'Ты прислал сумму больше, чем у тебя на счёте'

DAILY_STAT = 'Ну как там с деньгами?\n\n{}'

TOO_MUCH_TARGET = 'Ты прислал сумму больше, чем на счёте у {}'

ZERO_NOT_ALLOWED = 'Нельзя поставить ноль, дядя'

DO_NOT_PRESS_BUTTON = 'Хохла спросить забыли'

BET_FINISHED_HAHA = 'Сделка закрыта, было смешно\n\n@{} твой баланс {}\n@{} твой баланс {}'

BET_FINISHED_NOT_HAHA = 'Сделка закрыта, было не смешно\n\n@{} твой баланс {}\n@{} твой баланс {}'

API_DOES_NOT_WORK = 'Апишка сайта с анкеами упала, вернула {} ошибку. Literally 1984'

HELLO_NEW_USER = 'Здесь такая юмористическая дрисня, что тебе и не снилась. Тебя предупредили.'

WHY_YOU_LEAVE = 'Нахуя выходил из чата? Чтоб снова вернуться? Вероятно косячил с мемами, раз так получилось. ' \
                'Ты давай кончай'

BYE = 'Всё, пиздуй-бороздуй'

BET_DECLINED = '\n\nUPD: Ставку отменили'

ALREADY_HAHA = '\n\nUPD: Мем уже видели'

GOOGLE_API_ERROR = 'Опа, словил ошибку при попытке распознать текст на картинке\n\nТип: {}\n\nОшибка: {}'

FILE_ID_NEED_TO_REPLY = 'Нужно реплайнуть сообщение'

FILE_ID_NO_MESSAGE = 'В базе данных не сохранено это сообщение'

FILE_ID_DOES_NOT_EXIST = 'У данного сообщения нет file id. Либо оно старое, когда бот ещё не сохранял их, либо ' \
                         'ты реплаишь текстовое сообщение (нужно реплаить сообщение с любым файлом, например, фото, ' \
                         'видео и так далее)'

CAN_NOT_SEND_FILE = 'Кто-то неправильно создал FunnyAction, произошла ошибка:\n\n' \
                    'Тип ошибки: {}\nОписание:\n\n{}'

DONATE_ZERO_BALANCE = 'У тебя 0 на счёте, задонатить нечем. Жди понедельника'

SELECT_MONEY_RECEIVER = 'Выбери, кому отправить деньги'

SEND_DONATE_AMOUNT = 'Пришли сумму для перевода. Доступно Ржомбкоинов: {}'

DONATE_FINISHED = 'Деньги переведены\n\nТвой баланс: {}\nБаланс @{}: {}'

DONATE_ZERO_AMOUNT = 'Сумма не может быть меньше 1'

DONATE_TOO_MUCH_AMOUNT = 'У тебя нет столько денег, пришли нормальную сумму'

DONATE_ROTTEN = 'Заявка на донат стухла, давай по новой'

RECOGNITION_TYPE_CHANGE = 'Поменял модуль распознавания, теперь используем {}'
